tutorials/mesh/foamyHex2DMesh/OpenCFD/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp system/controlDict.mesher system/controlDict

runApplication surfaceFeatureExtract
runApplication foamyHex2DMesh -overwrite
runApplication extrude2DMesh -overwrite polyMesh2D
runApplication checkMesh -allGeometry -allTopology -constant -noZero


# ----------------------------------------------------------------- end-of-file
