tutorials/mesh/foamyHex2DMesh/OpenCFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    letters_text
    {
        type            patch;
        nFaces          1064;
        startFace       132063;
    }
    box_bottom
    {
        type            patch;
        nFaces          324;
        startFace       133127;
    }
    box_top
    {
        type            patch;
        nFaces          324;
        startFace       133451;
    }
    box_inlet
    {
        type            patch;
        nFaces          207;
        startFace       133775;
    }
    box_outlet
    {
        type            patch;
        nFaces          207;
        startFace       133982;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          64792;
        startFace       134189;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          64792;
        startFace       198981;
    }
)

// ************************************************************************* //
